In [1]:
import os
import pandas as pd

In [2]:
RI_2015 = os.path.join('../Resources/Rhode Island','nibrs_arrestee_2015.csv')
RI_2016 = os.path.join('../Resources/Rhode Island','nibrs_arrestee_2016.csv')
RI_2017 = os.path.join('../Resources/Rhode Island','nibrs_arrestee_2017.csv')
RI_2018 = os.path.join('../Resources/Rhode Island','nibrs_arrestee_2018.csv')
RI_2019 = os.path.join('../Resources/Rhode Island','nibrs_arrestee_2019.csv')

# Files to DataFrame

In [3]:
RI_2015_df = pd.read_csv(RI_2015)
RI_2016_df = pd.read_csv(RI_2016)
RI_2017_df = pd.read_csv(RI_2017)
RI_2018_df = pd.read_csv(RI_2018)
RI_2019_df = pd.read_csv(RI_2019)

# Select columns and copy DataFrame

In [4]:
RI_2015_df = RI_2015_df[['arrest_date','offense_type_id', 'sex_code']].copy()
RI_2016_df = RI_2016_df[['arrest_date','offense_type_id', 'sex_code']].copy()
RI_2017_df = RI_2017_df[['DATA_YEAR','ARREST_DATE','OFFENSE_TYPE_ID', 'SEX_CODE']].copy()
RI_2018_df = RI_2018_df[['DATA_YEAR','ARREST_DATE','OFFENSE_TYPE_ID', 'SEX_CODE']].copy()
RI_2019_df = RI_2019_df[['DATA_YEAR','ARREST_DATE','OFFENSE_TYPE_ID', 'SEX_CODE']].copy()

# Filter by offense_type = 35 for drug type

In [5]:
offense_type = 35

In [6]:
RI_2015_df = RI_2015_df[RI_2015_df.offense_type_id.eq(offense_type)]
RI_2015_df

               arrest_date  offense_type_id sex_code
13142  2015-08-10 00:00:00               35        M

In [7]:
RI_2016_df = RI_2016_df[RI_2016_df.offense_type_id.eq(offense_type)]
RI_2016_df

               arrest_date  offense_type_id sex_code
5765   2016-07-17 00:00:00               35        M
10511  2016-12-20 00:00:00               35        M
10512  2016-12-15 00:00:00               35        M
10513  2016-12-15 00:00:00               35        M
12187  2016-07-07 00:00:00               35        M

In [8]:
RI_2017_df = RI_2017_df[RI_2017_df.OFFENSE_TYPE_ID.eq(offense_type)]
RI_2017_df = RI_2017_df.reset_index(drop=True)
RI_2017_df = RI_2017_df.rename(columns={'DATA_YEAR':'year',"ARREST_DATE":'arrest_date','OFFENSE_TYPE_ID':'offense_type_id','SEX_CODE':'sex_code'})

In [9]:
RI_2017_df

   year arrest_date  offense_type_id sex_code
0  2017   23-DEC-17               35        M
1  2017   23-APR-17               35        M
2  2017   13-APR-17               35        F

In [10]:
RI_2018_df = RI_2018_df[RI_2018_df.OFFENSE_TYPE_ID.eq(offense_type)]
RI_2018_df = RI_2018_df.reset_index(drop=True)
RI_2018_df = RI_2018_df.rename(columns={'DATA_YEAR':'year',"ARREST_DATE":'arrest_date','OFFENSE_TYPE_ID':'offense_type_id','SEX_CODE':'sex_code'})

In [11]:
RI_2018_df

   year arrest_date  offense_type_id sex_code
0  2018   09-FEB-18               35        M
1  2018   09-FEB-18               35        F
2  2018   09-FEB-18               35        M
3  2018   09-FEB-18               35        M

In [12]:
RI_2019_df = RI_2019_df[RI_2019_df.OFFENSE_TYPE_ID.eq(offense_type)]
RI_2019_df = RI_2019_df.reset_index(drop = True)
RI_2019_df = RI_2019_df.rename(columns={'DATA_YEAR':'year',"ARREST_DATE":'arrest_date','OFFENSE_TYPE_ID':'offense_type_id','SEX_CODE':'sex_code'})

In [13]:
RI_2019_df

Empty DataFrame
Columns: [year, arrest_date, offense_type_id, sex_code]
Index: []

# Merge DataFrame and set up month and year before merging after 2016

In [14]:
merged = RI_2015_df.merge(RI_2016_df, how = 'outer')
merged2 = RI_2017_df.merge(RI_2018_df, how = 'outer')
merged3 = merged2.merge(RI_2019_df, how = 'outer')

In [15]:
merged15_16 = merged[['arrest_date','sex_code']].copy()

In [16]:
merged15_16

           arrest_date sex_code
0  2015-08-10 00:00:00        M
1  2016-07-17 00:00:00        M
2  2016-12-20 00:00:00        M
3  2016-12-15 00:00:00        M
4  2016-12-15 00:00:00        M
5  2016-07-07 00:00:00        M

In [17]:
dates = merged15_16['arrest_date'].str.split('-')
month = []
for number in dates:
    month.append(int(number[1]))

In [18]:
merged15_16['arrest_date'] = month
merged15_16 = merged15_16.rename(columns={'arrest_date':'month'})
merged15_16['year'] = [2015,2016,2016,2016,2016,2016]

In [19]:
merged15_16

   month sex_code  year
0      8        M  2015
1      7        M  2016
2     12        M  2016
3     12        M  2016
4     12        M  2016
5      7        M  2016

# Set up month and Year

In [20]:
merged17_19 = merged3[['year','arrest_date','sex_code']].copy()

In [21]:
merged17_19

   year arrest_date sex_code
0  2017   23-DEC-17        M
1  2017   23-APR-17        M
2  2017   13-APR-17        F
3  2018   09-FEB-18        M
4  2018   09-FEB-18        M
5  2018   09-FEB-18        M
6  2018   09-FEB-18        F

In [22]:
date = merged17_19['arrest_date'].str.split('-')
month = []
for number in date:
    if number[1] == 'JAN':
        month.append(1)
    if number[1] == 'FEB':
        month.append(2)
    if number[1] == 'MAR':
        month.append(3)
    if number[1] == 'APR':
        month.append(4)
    if number[1] == 'MAY':
        month.append(5)
    if number[1] == 'JUN':
        month.append(6)
    if number[1] == 'JUL':
        month.append(7)
    if number[1] == 'AUG':
        month.append(8)
    if number[1] == 'SEP':
        month.append(9)
    if number[1] == 'OCT':
        month.append(10)
    if number[1] == 'NOV':
        month.append(11)
    if number[1] == 'DEC':
        month.append(12)

In [23]:
merged17_19['arrest_date'] = month
merged17_19 = merged17_19.rename(columns={'arrest_date':'month'})

In [24]:
merged17_19

   year  month sex_code
0  2017     12        M
1  2017      4        M
2  2017      4        F
3  2018      2        M
4  2018      2        M
5  2018      2        M
6  2018      2        F

# Merge both DataFrame to create Rhode Island DataFrame
## set state = RI

In [25]:
RI_df = merged15_16.merge(merged17_19, how = 'outer')
RI_df['state'] = 'RI'

RI_df = RI_df[['year','month','state','sex_code']]

In [26]:
RI_df

    year  month state sex_code
0   2015      8    RI        M
1   2016      7    RI        M
2   2016      7    RI        M
3   2016     12    RI        M
4   2016     12    RI        M
5   2016     12    RI        M
6   2017     12    RI        M
7   2017      4    RI        M
8   2017      4    RI        F
9   2018      2    RI        M
10  2018      2    RI        M
11  2018      2    RI        M
12  2018      2    RI        F

# Save to csv file

In [27]:
RI_df.to_csv('../Resources/Rhode Island/rhode_island.csv')